package ua.syt0r.kanji.core.japanese

import kotlinx.serialization.Serializable

private fun String.kanjiStringToList(): List<String> = map { it.toString() }

@Serializable
sealed interface CharacterClassification {

    val characters: List<String>

    @Serializable
    sealed interface Kana : CharacterClassification {

        companion object {
            val all = listOf(Hiragana, Katakana)
        }

        @Serializable
        object Hiragana : Kana {
            override val characters: List<String> = allHiraganaReadings.keys
                .map { it.toString() }
        }

        @Serializable
        object Katakana : Kana {
            override val characters: List<String> = Hiragana.characters
                .map { hiraganaToKatakana(it.first()).toString() }
        }

    }

    @Serializable
    data class JLPT(
        val level: Int
    ) : CharacterClassification {

        companion object {

            private val levelToKanji = (5 downTo 1)
                .zip(listOf(n5, n4, n3, n2, n1))
                .toMap()

            val all: List<JLPT>
                get() = (5 downTo 1).map { JLPT(it) }

        }

        override val characters: List<String> = levelToKanji.getValue(level).kanjiStringToList()

    }

    @Serializable
    data class Grade(
        val number: Int
    ) : CharacterClassification {

        companion object {

            val all: List<Grade>
                get() = (1..6).plus(8..10).map { Grade(it) }

        }

        override val characters: List<String> = GradeLevels.getValue(number).kanjiStringToList()

    }

    @Serializable
    data class Wanikani(
        val level: Int
    ) : CharacterClassification {

        companion object {

            val all: List<Wanikani>
                get() = (1..60).map { Wanikani(it) }

        }

        init {
            require(level in 1..60)
        }

        override val characters: List<String> = WanikaniLevels.getValue(level).kanjiStringToList()

    }

}

/***
 * From web archive version of http://www.tanos.co.uk
 * Execute in js console: $$(tr > td:first-child > a).map(x => x.textContent.trim()).join()
 */
private const val n1 =
    "氏統保第結派案策基価提挙応企検藤沢裁証援施井護展態鮮視条幹独宮率衛張監環審義訴株姿閣衆評影松撃佐核整融製票渉響推請器士討攻崎督授催及憲離激摘系批郎健盟従修隊織拡故振弁就異献厳維浜遺塁邦素遣抗模雄益緊標宣昭廃伊江僚吉盛皇臨踏壊債興源儀創障継筋闘葬避司康善逮迫惑崩紀聴脱級博締救執房撤削密措志載陣我為抑幕染奈傷択秀徴弾償功拠秘拒刑塚致繰尾描鈴盤項喪伴養懸街契掲躍棄邸縮還属慮枠恵露沖緩節需射購揮充貢鹿却端賃獲郡併徹貴衝焦奪災浦析譲称納樹挑誘紛至宗促慎控智握宙俊銭渋銃操携診託撮誕侵括謝駆透津壁稲仮裂敏是排裕堅訳芝綱典賀扱顧弘看訟戒祉誉歓奏勧騒閥甲縄郷揺免既薦隣華範隠徳哲杉釈己妥威豪熊滞微隆症暫忠倉彦肝喚沿妙唱阿索誠襲懇俳柄驚麻李浩剤瀬趣陥斎貫仙慰序旬兼聖旨即柳舎偽較覇詳抵脅茂犠旗距雅飾網竜詩繁翼潟敵魅嫌斉敷擁圏酸罰滅礎腐脚潮梅尽僕桜滑孤炎賠句鋼頑鎖彩摩励縦輝蓄軸巡稼瞬砲噴誇祥牲秩帝宏唆阻泰賄撲堀菊絞縁唯膨矢耐塾漏慶猛芳懲剣彰棋丁恒揚冒之倫陳憶潜梨仁克岳概拘墓黙須偏雰遇諮狭卓亀糧簿炉牧殊殖艦輩穴奇慢鶴謀暖昌拍朗寛覆胞泣隔浄没暇肺貞靖鑑飼陰銘随烈尋稿丹啓也丘棟壌漫玄粘悟舗妊熟旭恩騰往豆遂狂岐陛緯培衰艇屈径淡抽披廷錦准暑磯奨浸剰胆繊駒虚霊帳悔諭惨虐翻墜沼据肥徐糖搭盾脈滝軌俵妨擦鯨荘諾雷漂懐勘栽拐駄添冠斜鏡聡浪亜覧詐壇勲魔酬紫曙紋卸奮欄逸涯拓眼獄尚彫穏顕巧矛垣欺釣萩粛栗愚嘉遭架鬼庶稚滋幻煮姫誓把践呈疎仰剛疾征砕謡嫁謙后嘆菌鎌巣頻琴班棚潔酷宰廊寂辰霞伏碁俗漠邪晶墨鎮洞履劣那殴娠奉憂朴亭淳怪鳩酔惜穫佳潤悼乏該赴桑桂髄虎盆晋穂壮堤飢傍疫累痴搬晃癒桐寸郭尿凶吐宴鷹賓虜陶鐘憾猪紘磁弥昆粗訂芽庄傘敦騎寧循忍怠如寮祐鵬鉛珠凝苗獣哀跳匠垂蛇澄縫僧眺亘呉凡憩媛溝恭刈睡錯伯笹穀陵霧魂弊妃舶餓窮掌麗綾臭悦刃縛暦宜盲粋辱毅轄猿弦稔窒炊洪摂飽冗桃狩朱渦紳枢碑鍛刀鼓裸猶塊旋弓幣膜扇腸槽慈楊伐駿漬糾亮墳坪紺娯椿舌羅峡俸厘峰圭醸蓮弔乙汁尼遍衡薫猟羊款閲偵喝敢胎酵憤豚遮扉硫赦窃泡瑞又慨紡恨肪扶戯伍忌濁奔斗蘭迅肖鉢朽殻享秦茅藩沙輔媒鶏禅嘱胴迭挿嵐椎絹陪剖譜郁悠淑帆暁傑楠笛玲奴錠拳翔遷拙侍尺峠篤肇渇叔雌亨堪叙酢吟逓嶺甚喬崇漆岬癖愉寅礁乃洲屯樺槙姻巌擬塀唇睦閑胡幽峻曹詠卑侮鋳抹尉槻隷禍蝶酪茎帥逝汽琢匿襟蛍蕉寡琉痢庸朋坑藍賊搾畔遼唄孔橘漱呂拷嬢苑巽杜渓翁廉謹瞳湧欣窯褒醜升殉煩巴禎劾堕租稜桟倭婿慕斐罷矯某囚魁虹鴻泌於赳漸蚊葵厄藻禄孟嫡尭嚇巳凸暢韻霜硝勅芹杏棺儒鳳馨慧愁楼彬匡眉欽薪褐賜嵯綜繕栓翠鮎榛凹艶惣蔦錬隼渚衷逐斥稀芙詔皐雛惟佑耀黛渥憧宵妄惇脩甫酌蚕嬉蒼暉頒只肢檀凱彗謄梓丑嗣叶汐絢朔伽畝抄爽黎惰蛮冴旺萌偲壱瑠允侯蒔鯉弧遥舜瑛附彪卯但綺芋茜凌皓洸毬婆緋鯛怜邑倣碧啄穣酉悌倹柚繭亦詢采紗賦眸玖弐錘諄倖痘笙侃裟洵爾耗昴銑莞伶碩宥滉晏伎朕迪綸且竣晨吏燦麿頌箇楓琳梧哉澪匁晟衿凪梢丙颯茄勺恕蕗瑚遵瞭燎虞柊侑謁斤嵩捺蓉茉袈燿誼冶栞墾勁菖旦椋叡紬胤凜亥爵脹麟莉汰瑶瑳耶椰絃丞璃奎塑昂柾熙菫諒鞠崚濫捷"

private const val n2 =
    "党協総区領県設改府査委軍団各島革村勢減再税営比防補境導副算輸述線農州武象域額欧担準賞辺造被技低復移個門課脳極含蔵量型況針専谷史階管兵接細効丸湾録省旧橋岸周材戸央券編捜竹超並療採森競介根販歴将幅般貿講林装諸劇河航鉄児禁印逆換久短油暴輪占植清倍均億圧芸署伸停爆陸玉波帯延羽固則乱普測豊厚齢囲卒略承順岩練軽了庁城患層版令角絡損募裏仏績築貨混昇池血温季星永著誌庫刊像香坂底布寺宇巨震希触依籍汚枚複郵仲栄札板骨傾届巻燃跡包駐弱紹雇替預焼簡章臓律贈照薄群秒奥詰双刺純翌快片敬悩泉皮漁荒貯硬埋柱祭袋筆訓浴童宝封胸砂塩賢腕兆床毛緑尊祝柔殿濃液衣肩零幼荷泊黄甘臣浅掃雲掘捨軟沈凍乳恋紅郊腰炭踊冊勇械菜珍卵湖喫干虫刷湯溶鉱涙匹孫鋭枝塗軒毒叫拝氷乾棒祈拾粉糸綿汗銅湿瓶咲召缶隻脂蒸肌耕鈍泥隅灯辛磨麦姓筒鼻粒詞胃畳机膚濯塔沸灰菓帽枯涼舟貝符憎皿肯燥畜挟曇滴伺"

private const val n3 =
    "政議民連対部合市内相定回選米実関決全表戦経最現調化当約首法性要制治務成期取都和機平加受続進数記初指権支産点報済活原共得解交資予向際勝面告反判認参利組信在件側任引求所次昨論官増係感情投示変打直両式確果容必演歳争談能位置流格疑過局放常状球職与供役構割費付由説難優夫収断石違消神番規術備宅害配警育席訪乗残想声念助労例然限追商葉伝働形景落好退頭負渡失差末守若種美命福望非観察段横深申様財港識呼達良候程満敗値突光路科積他処太客否師登易速存飛殺号単座破除完降責捕危給苦迎園具辞因馬愛富彼未舞亡冷適婦寄込顔類余王返妻背熱宿薬険頼覚船途許抜便留罪努精散静婚喜浮絶幸押倒等老曲払庭徒勤遅居雑招困欠更刻賛抱犯恐息遠戻願絵越欲痛笑互束似列探逃遊迷夢君閉緒折草暮酒悲晴掛到寝暗盗吸陽御歯忘雪吹娘誤洗慣礼窓昔貧怒泳祖杯疲皆鳴腹煙眠怖耳頂箱晩寒髪忙才靴恥偶偉猫幾"

private const val n4 =
    "会同事自社発者地業方新場員立開手力問代明動京目通言理体田主題意不作用度強公持野以思家世多正安院心界教文元重近考画海売知道集別物使品計死特私始朝運終台広住真有口少町料工建空急止送切転研足究楽起着店病質待試族銀早映親験英医仕去味写字答夜音注帰古歌買悪図週室歩風紙黒花春赤青館屋色走秋夏習駅洋旅服夕借曜飲肉貸堂鳥飯勉冬昼茶弟牛魚兄犬妹姉漢"

private const val n5 =
    "日一国人年大十二本中長出三時行見月後前生五間上東四今金九入学高円子外八六下来気小七山話女北午百書先名川千水半男西電校語土木聞食車何南万毎白天母火右読友左休父雨"

/***
 * From https://www.wanikani.com/kanji?difficulty=pleasant
 * Execute in js console:
 * $$(section.character-grid).map(group => [group.querySelector(.character-grid__header-text).textContent, Array.from(group.querySelectorAll(span.character-item__characters)).map(c => c.textContent.trim()).join()].join(" ")).join(\n)
 */
private val WanikaniLevels: Map<Int, String> = mapOf(
    1 to "上下大工八入山口九一人力川七十三二女",
    2 to "玉本子丸正土犬夕出目了火五四才手天王左中月々田右六小立丁日刀千木水白文円",
    3 to "矢市牛切方戸太父少友毛半心内生台母午北今古元外分引止用万広冬",
    4 to "竹車央写仕耳早気平花足打百氷虫字男主名不号他去皿先赤休申見貝石代礼糸町宝村世年",
    5 to "角斤青体色来社当図毎羽林行金草里作多肉会交近兄雨米走同言自形皮空音学光考回谷声西何麦弟",
    6 to "全後血両明京化国科亡死画地東食直前有私知活長曲首次夜姉点安室海羊店南星州茶思歩向妹",
    7 to "辺付札鳥黒船必末氏失魚以組家欠未紙通民理由校雪強夏高教時弱週風記黄",
    8 to "答反君局買雲楽数決絵住電森助馬間場医朝番所池究道役研身者支話投対",
    9 to "受事美予服度発定談表客重持負相要新部和県保返乗屋売送苦泳仮験物具実試使勝界",
    10 to "進酒始業算運漢鳴集配飲終顔落農速頭聞院調鉄語葉習軽線最開頁親公読求転路病横歌起",
    11 to "功成岸競争便老命指初味追神良意労級好昔低育令拾注利位仲放秒別特共努伝戦波洋働",
    12 to "悪息章登寒深倍勉消祭野階庭港暑湯僕島童員商都動第期植根短球泉流合陽歯族旅待温着",
    13 to "皆謝整橋選想器暗疑料感情様養緑熱億殺宿福鏡然詩練賞問館映願士課標銀駅像題輪",
    14 to "能芸雰骨束周協例折基性妥卒固望材参完松約残季技格苺頑囲的術念希狼",
    15 to "紀軍秋信岩仏建猫変晴築勇泣司区英丈夫飯計法晩昼払毒昨帰式列浅単坂匹春寺",
    16 to "浴箱係治危冒留弁証存面遠園門府幸阪急笑荷政品守辞真関険典専冗取曜書",
    17 to "是結底因詳識劇干敗渉果官署察堂幻非愛薬覚常鼻無原栄喜恋悲塩席側兵説細梅虚警",
    18 to "告達焼借弓脳飴胸喫等枚忘苛訓種報句許可祈僧禁静座煙汽叩喉類洗禅",
    19 to "得加冊履忙閥布比歴続減易絡笛容団史昆徒宙混善順宇詞改乱節連舌暴財若",
    20 to "裕尻確械犯害議難災嫌困夢震在飛産罪穴被個機妨倒経率圧防臭余尾論厚妻",
    21 to "責条済委省制批断任素敵羨設評検岡増査審判件際企挙認資義権派務税解総",
    22 to "援態誕状賀各費姿勢諦示寝営坊罰策案提置域応宮袖吸過領脱統価値副観藤",
    23 to "演呼崎施城護鬼割職秀俳停宅痒裁律導革贅乳収現備則規準張優沢師幹看",
    24 to "庁額腕境燃担祝届違差象展層視環製述武型狭管載質量販供肩株触輸腰",
    25 to "慣居逮票属捉捕候輩況響効莫抜鮮満与掛隠模含訟限肥豊替景巻捜構影絞訴補渡",
    26 to "接再独獣菓討故較造創励激占障我徴授往鉛郵針従豚復河貯印振刺突怪汗筆",
    27 to "怒昇迷招腹睡康端極郎健誘貸惑痛退途給就靴眠暇段胃症濃締迫訪織悩屈",
    28 to "攻撃浜綺益児憲冷処微修博程絶凍巨稚幼並麗奇衆清潔録逆移精隊庫妙券傘婦",
    29 to "略積添寄宴板壊督僚杯娘診乾欧恐猛江韓雄航監宗請怖索臣催街詰緊閣促烈",
    30 to "更魅背騒飾預版柵旗浮越照漏系覧婚懐撮枕遊快貧延押乏匂盗購適翌渇符濡",
    31 to "帯廊離径融均豪除貨孫墓幾尋編陸探鑑泥巣普棒粉既救似富散華嘆偵驚掃菜脈徳倉",
    32 to "酸賛祖銭込衛机汚飼複染卵永績眼液採志興恩久党序雑桜密秘厳捨訳欲暖迎傷",
    33 to "灰装著裏閉股垂漠異皇拡屁暮忠肺誌操筋否盛宣賃敬尊熟噂砂簡蒸蔵糖納諸窓",
    34 to "豆枝揮刻爪承咳幕紅歓降奴聖推臓損磁誤源芋純薦丼腐沿射縮隷粋痩吐貴縦勤拝",
    35 to "熊噌彫杉喋銅舎酔炎彼紹介湖講寿測互油己鍋獄戚為恥遅汁醤滞剣破亀厄酢",
    36 to "諾盟将舞債伎鹿換姓牙旧般津療継遺維奈核廃献沖摘及依縄鮭踏伸甘貿頼超幅",
    37 to "患狙陣塁弾葬抗崩遣掲爆眉恵漁香湾跳抱旬聴臨兆契刑募償抵戻昭串闘執跡削",
    38 to "伴齢宜噛賄賂房慮託却需璧致避描刊逃扱奥併膝傾緩奏妊娠贈択還繰抑懸称緒盤",
    39 to "控宛充渋岐埋鈴埼棋囚譲雇免群枠銃仙邦御慎躍謙阜片項斐隆圏勧拒稲奪鋼甲壁祉",
    40 to "拉敏吹唱衝戒兼薄堀剤雅孝頻駆俊嬉誉茂殿殖隣麺繁巡柱携褒排駐顧犠獲鋭敷妖透",
    41 to "棄凄至拠蜂儀炭衣潜偽畑蛍拳郷蜜仁遜侵嘘鉱喧伺徹瀬嘩墟酎措誠虎艦撤樹包",
    42 to "析弧到軸綱挑焦掘紛範括床握枢揚潟芝肝餅喪網克泊双柄哲斎袋揺滑堅暫糾荒",
    43 to "襲沼朗摩趣懲慰懇筒滅距籍露炉柔擦琴垣即威滋牧泰旨刷珍封斉沈撲裂潮貢誰",
    44 to "刃缶砲笠竜拶縁忍釣吉粒髪丘俺斗寸桃梨姫挨娯謎侍叱棚叫辛芽嵐涙雷塔朱翼",
    45 to "頃菌鐘舟嫁暦曇也塾呪湿稼疲翔賭霊溝狩脚澄塊狂嬢裸岳磨陰肌魂矛眺硬卓凶滝井",
    46 to "墨瞬泡穏孔椅菊涼綿魔寮鳩鈍鍛碁癖穂吾鍵盆庄猿棟誇瞳寧俵幽架黙斬帝租錬阻歳零",
    47 to "幣箸瞭崖炊粧墜欺滴塀霧扇扉恨帽憎佐挿伊詐如唇掌婆哀虹爽憩煎尺砕粘畳胴巾芯柳",
    48 to "遂蓄脇殴咲鉢賢彩隙培踊闇斜霜穫麻騎辱灯畜溶蚊帳塗貼輝憶悔耐盾蛇班餓飢迅脅尽",
    49 to "概拘煮覆駒悟慌謀鶴拓衰奨淡礎陛浸劣勘隔蹴桑尼珠抽壇陶妃刈紫唯剛征誓俗潤",
    50 to "偶巧鰐把駄洞伯唐彰諮廷蟹晶堰漂淀堤后疫翻鬱涯銘仰漫簿亭訂壮軌奮峰墳搬邪",
    51 to "又肯浦挟沸瓶召貞亮襟隅郡燥釈脂偉軒蓮慈塚玄肪耕媛邸喚苗隻膚軟郊頂濯渦聡枯",
    52 to "祥呂偏茨陥鎖賠恒綾没擁遭噴殊倫陳隼乃輔猟唆怠惰覇須牲秩孤芳貫糧颯慢膨遇",
    53 to "諭随胡搭錦鯉胞浄帥諒蒙曙惨稿啓披繊徐葵騰据莉緯瓜虐戴艇丹緋准舗壌駿剰寛",
    54 to "庶且顕杏栞欄冠酷叙逸紋阿愚尚拐悠勲疎謡栽践呈傲疾茜酬呆鎌粛茎痴哺荘鯨卸",
    55 to "累伏虜循粗凝栓瑛旦奉遼郭抹佳惜憂悼癒栃龍弥髄勿傍愉赴昌憾朴脊該之鎮尿賓那",
    56 to "匠拍縛飽柴蝶弦凛庸錯轄悦窮嘉弊遥洪紳呉穀摂寂宰陵凡尉靖恭縫舶搾猶窒碑智",
    57 to "盲醸凹弔凸烏敢堕鼓衡伐酵閲遮腸乙楓膜紺蒼漬哉峡賊旋俸喝羅萌槽坪遍胎",
    58 to "陪扶迭鶏瑞暁剖凌藩譜璃淑傑殻瑠錠媒濁赦戯享嘱肖憤朽奔帆菅酌慨絹椎窃硫",
    59 to "亜屯岬鋳拙詠慶酪篤侮堪禍雌睦胆擬梓漆閑憧卑姻忌曹峠吟礁沙蔑汰紡遷叔甚浪崇",
    60 to "煩款蛮廉劾某矯痢逝狐漸升婿匿謹藍桟殉坑罷妄漣藻泌唄畔倹拷醜冥渓湧寡慕",
)

private val GradeLevels = mapOf(
    1 to "一右雨円王音下火花貝学気休玉金九空月犬見五口校左三山四子糸字耳七車手十出女小上森人水正生青石赤先千川早草足村大男竹中虫町天田土二日入年白八百文本名木目夕立力林六",
    2 to "引羽雲園遠黄何夏家科歌画会回海絵外角楽活間丸岩顔帰汽記弓牛魚京強教近兄形計元原言古戸午後語交光公工広考行高合国黒今才細作算姉市思止紙寺時自室社弱首秋週春書少場色食心新親図数星晴声西切雪線船前組走多太体台谷知地池茶昼朝長鳥直通弟店点電冬刀東当答頭同道読内南肉馬買売麦半番父風分聞米歩母方北妹毎万明鳴毛門夜野矢友曜用来理里話",
    3 to "悪安暗委意医育員飲院運泳駅央横屋温化荷界開階寒感漢館岸期起客宮急球究級去橋業局曲銀区苦具君係軽決血研県庫湖向幸港号根祭坂皿仕使始指死詩歯事持次式実写者主取守酒受州拾終習集住重宿所暑助勝商昭消章乗植深申真神身進世整昔全想相送息速族他打対待代第題炭短談着柱注丁帳調追定庭笛鉄転登都度島投湯等豆動童農波配倍箱畑発反板悲皮美鼻筆氷表病秒品負部服福物平返勉放味命面問役薬油有由遊予様洋羊葉陽落流旅両緑礼列練路和",
    4 to "愛案以位囲胃衣井茨印栄英塩岡沖億加果課貨芽改械害街各覚潟完官管観関願喜器岐希旗機季紀議救求泣給挙漁競共協鏡極熊訓軍郡型径景芸欠結健建験固候功好康航香告佐差最菜材阪崎埼昨刷察札殺参散産残司史士氏試児滋治辞鹿失借種周祝順初唱松焼照省笑象賞信臣成清静席積折節説戦浅選然倉巣争側束続卒孫帯隊達単置仲貯兆腸低停底的典伝徒努灯働堂得特毒栃奈縄熱念敗梅博飯費飛必媛標票不付夫府阜副粉兵別変辺便包法望牧末満未脈民無約勇要養浴利梨陸料良量輪類令例冷歴連労老録",
    5 to "圧易移因営永衛液益演往応恩仮価可河過賀解快格確額刊幹慣眼基寄規技義逆久旧居許境興均禁句群経潔件券検険減現限個故護効厚構耕講鉱混査再妻採災際在罪財桜雑賛酸師志支枝資飼似示識質舎謝授修術述準序承招証常情条状織職制勢性政精製税績責接設絶舌銭祖素総像増造則測属損態貸退団断築張提程敵適統導銅徳独任燃能破判版犯比肥非備俵評貧婦富布武復複仏編弁保墓報豊暴貿防務夢迷綿輸余預容率略留領",
    6 to "異遺域宇映延沿我灰拡閣革割株巻干看簡危揮机貴疑吸供胸郷勤筋敬系警劇激穴憲権絹厳源呼己誤后孝皇紅鋼降刻穀骨困砂座済裁策冊蚕姿私至視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除傷将障城蒸針仁垂推寸盛聖誠宣専泉洗染善創奏層操窓装臓蔵存尊宅担探誕暖段値宙忠著庁潮頂賃痛展党糖討届難乳認納脳派俳拝背肺班晩否批秘腹奮並閉陛片補暮宝訪亡忘棒枚幕密盟模訳優郵幼欲翌乱卵覧裏律臨朗論",
    8 to "亜哀挨握扱宛闇依偉威尉慰椅為畏維緯萎違壱逸稲芋咽姻淫陰隠韻臼渦唄浦餌影詠鋭疫悦謁越閲宴怨援炎煙猿縁艶鉛汚凹奥押旺欧殴翁憶臆乙俺卸穏佳嫁寡暇架禍稼箇苛華菓蚊牙雅餓介塊壊怪悔懐戒拐皆劾崖慨概涯蓋該骸垣柿嚇核殻獲穫較郭隔岳顎掛喝括渇滑葛褐轄且釜鎌刈瓦乾冠勘勧喚堪寛患憾換敢棺款歓汗環甘監緩缶肝艦貫還鑑閑陥韓含玩頑企伎奇幾忌既棋棄畿祈軌輝飢騎鬼亀偽儀宜戯擬欺犠菊吉喫詰却脚虐丘及朽窮糾巨拒拠虚距享凶叫峡恐恭挟況狂狭矯脅響驚仰凝暁僅巾錦斤琴緊菌襟謹吟駆駒愚虞偶遇隅串屈掘窟靴繰桑勲薫傾刑啓契恵慶憩掲携渓稽継茎蛍詣鶏迎鯨撃隙桁傑倹兼剣圏堅嫌懸拳献肩謙賢軒遣鍵顕幻弦玄舷孤弧枯股虎誇雇顧鼓互呉娯御悟碁乞侯勾喉坑孔巧恒慌抗拘控攻更梗江洪溝甲硬稿絞綱肯荒衡貢購郊酵項剛拷豪克酷獄腰込頃墾婚恨懇昆痕紺魂唆沙詐鎖挫債催塞宰彩栽歳采砕斎載剤咲削搾柵索錯拶撮擦傘惨桟斬暫伺刺嗣施旨祉紫肢脂諮賜雌侍慈璽軸叱執嫉湿漆疾芝赦斜煮遮蛇邪爵酌釈寂朱殊狩珠腫趣儒呪寿需囚愁秀臭舟襲蹴酬醜充柔汁渋獣銃叔淑粛塾俊瞬准循旬殉潤盾巡遵庶緒叙徐償匠升召奨宵尚床彰抄掌昇晶沼渉焦症硝礁祥称粧紹肖衝訟詔詳鐘丈冗剰壌嬢浄畳譲醸錠嘱飾拭殖触辱尻伸侵唇娠寝審慎振浸紳芯薪診辛震刃尋甚尽腎迅陣須酢吹帥炊睡粋衰遂酔随髄崇枢据杉裾澄瀬畝是凄姓征牲誓請逝醒斉隻惜戚斥析籍脊跡拙摂窃仙占扇栓潜煎旋繊羨腺薦詮践遷鮮漸禅繕膳塑措曽狙疎礎租粗訴阻遡僧双喪壮爽捜掃挿曹槽燥痩荘葬藻遭霜騒憎贈促即捉俗賊袖遜汰唾堕妥惰駄堆耐怠戴替泰滞胎袋逮滝卓択拓沢濯託濁諾但奪脱棚誰丹嘆旦淡端綻胆鍛壇弾恥痴稚致遅畜蓄逐秩窒嫡抽衷酎鋳駐弔彫徴懲挑眺聴超跳勅捗朕沈珍鎮陳津墜椎塚漬潰坪爪釣鶴亭偵貞呈堤帝廷抵締艇訂諦逓邸泥摘滴溺哲徹撤迭添貼殿吐塗妬斗渡賭途奴怒倒凍唐塔悼搭桃棟盗痘筒到藤謄踏逃透陶騰闘憧洞瞳胴峠匿督篤凸突屯豚頓曇鈍那謎鍋軟尼弐匂虹如尿妊忍寧猫捻粘悩濃把覇婆罵廃排杯輩培媒賠陪伯剥拍泊舶薄迫漠爆縛箸肌鉢髪伐罰抜閥伴帆搬斑氾汎畔繁般藩販範煩頒盤蛮卑妃彼扉披泌疲碑罷被避尾微眉匹膝肘姫漂描苗浜賓頻敏瓶怖扶敷普浮符腐膚譜賦赴附侮舞封伏幅覆払沸噴墳憤紛雰丙併塀幣弊柄蔽壁癖蔑偏遍舗捕穂募慕簿倣俸奉峰崩抱泡砲縫胞芳蜂褒邦飽乏傍剖坊妨帽忙房某冒紡肪膨謀貌僕墨撲朴睦勃没堀奔翻凡盆摩磨魔麻埋昧膜枕又抹繭慢漫魅岬蜜妙眠矛霧婿娘冥銘滅免麺茂妄猛盲網耗黙餅戻紋冶弥厄躍柳愉癒諭唯幽悠憂湧猶裕誘雄融与誉妖庸揚揺擁溶窯謡踊抑沃翼羅裸頼雷絡酪嵐欄濫藍吏履璃痢離硫粒隆竜侶慮虜了僚寮涼猟療瞭糧陵倫厘隣瑠塁涙累励鈴隷零霊麗齢暦劣烈裂廉恋錬呂炉賂露廊弄楼浪漏郎麓賄脇惑枠湾腕丼傲刹哺喩嗅嘲毀彙恣惧慄憬拉摯曖楷鬱璧瘍箋籠緻羞訃諧貪踪辣錮塡頰",
    9 to "娃阿逢葵茜渥旭葦芦梓斡絢綾鮎或粟庵按鞍杏伊夷惟謂亥郁磯溢鰯允胤蔭烏迂卯鵜窺丑碓姥厩瓜閏噂云叡曳瑛榎堰奄燕苑於甥襖荻桶牡伽嘉珂禾茄蝦嘩迦霞俄峨臥駕廻恢魁晦芥蟹凱鎧浬馨笠樫梶恰叶椛樺鞄兜蒲鴨茅萱粥侃柑竿莞巌雁嬉毅稀徽祇誼掬鞠桔橘砧杵汲灸笈鋸亨匡卿喬蕎饗尭桐欣欽禽芹衿玖矩喰寓櫛釧屑沓窪隈栗鍬袈祁圭慧桂戟訣倦喧捲牽硯絃諺乎糊袴胡跨伍吾梧檎瑚醐鯉倖宏巷庚弘昂晃杭浩紘腔膏閤鴻劫壕轟忽惚此昏些叉嵯瑳裟坐哉犀砦冴堺榊肴鷺朔窄笹薩皐錆晒撒燦珊纂讃仔孜斯獅爾而蒔汐竺雫悉篠偲柴縞紗勺灼錫惹洲蒐輯峻竣舜駿楯淳醇曙渚恕哨嘗庄捷昌梢樟湘菖蕉裳鞘丞杖穣埴燭晋榛秦壬訊諏厨逗翠錐錘瑞嵩雛菅頗雀摺棲栖蹟碩尖撰穿銑閃噌楚疏蘇叢宋惣槍漕綜聡蒼其揃舵楕陀苔黛鯛醍鷹啄托琢茸凧只辰巽竪辿樽坦歎湛耽檀弛智馳筑註猪喋寵帖暢牒脹蝶槌槻佃柘辻蔦綴椿紬悌挺梯汀禎蹄鄭釘鼎擢纏兎堵杜砥套宕祷董撞萄鳶寅酉惇敦沌遁凪薙灘捺楢馴楠汝賑廿濡禰祢乃之巴播杷琶芭煤這秤萩柏箔曝莫函肇筈幡畠鳩塙隼挽磐蕃庇斐緋樋枇毘琵柊疋彦菱畢桧紐彪瓢豹廟彬瀕斧芙撫葡蕪楓葺蕗淵吻焚頁碧瞥篇娩鞭圃甫輔戊菩捧朋萌蓬鋒鳳鵬卜殆幌哩槙柾鱒亦俣沫迄麿蔓巳箕湊蓑稔牟椋姪孟蒙儲勿尤籾貰匁也耶靖佑宥柚祐邑輿傭楊耀蓉遥淀螺洛蘭李裡掠劉溜琉亮凌梁稜諒遼淋琳鱗麟伶嶺怜玲憐漣煉簾蓮魯櫓狼禄肋倭鷲亙亘詫藁蕨椀碗侑俐凛凰勁奎崚巖巫已彗徠惺昊昴晏晄晨晟暉檜栞梛椰橙櫂毬洸洵渾滉漱澪煌燎燿珈珀琥瑶皓眸祿稟穰穹笙絆綺綸羚翔脩苺茉莉菫萠蕾詢諄赳迪逞釉頌颯驍麒黎堯槇遙凜熙摑焰禱繡繫萊蔣醬顚鷗俱吞簞蟬",
    10 to "薗駈曾瀧嶋燈埜盃冨峯龍乘亞佛來傳僞價儉兒凉剩劍勳卷單嚴圈國圓團壞壘壯壽奧奬孃實寢將專峽帶廣廳彈彌從恆惡惠愼應懷戰戲拔拜拂搜搖攝收敍晝曉條榮樂樣檢櫻盜氣淨滯澁濕燒爭爲狹默獸疊盡眞碎祕禪禮稻穗粹縣縱纖飜聽臟與莊萬藏藝藥衞裝覽謠讓賣轉醉釀鎭鑄陷險雜靜顯騷驗髮鷄齊黃黑"
)
