package ua.syt0r.kanji.parser

import ua.syt0r.kanji.common.CharactersClassification

/***
 * From https://www.wanikani.com/kanji?difficulty=pleasant
 * Execute in js console:
 * $$('section.character-grid').map(group => [group.querySelector('.character-grid__header-text').textContent, Array.from(group.querySelectorAll('span.character-item__characters')).map(c => c.textContent.trim()).join('')].join(" ")).join('\n')
 */

val WanikaniLevels: Map<CharactersClassification.Wanikani, List<String>> = listOf(
    1 to "上下大工八入山口九一人力川七十三二女",
    2 to "玉本子丸正土犬夕出目了火五四才手天王左中月々田右六小立丁日刀千木水白文円",
    3 to "矢市牛切方戸太父少友毛半心内生台母午北今古元外分引止用万広冬",
    4 to "竹車央写仕耳早気平花足打百氷虫字男主名不号他去皿先赤休申見貝石代礼糸町宝村世年",
    5 to "角斤青体色来社当図毎羽林行金草里作多肉会交近兄雨米走同言自形皮空音学光考回谷声西何麦弟",
    6 to "全後血両明京化国科亡死画地東食直前有私知活長曲首次夜姉点安室海羊店南星州茶思歩向妹",
    7 to "辺付札鳥黒船必末氏失魚以組家欠未紙通民理由校雪強夏高教時弱週風記黄",
    8 to "答反君局買雲楽数決絵住電森助馬間場医朝番所池究道役研身者支話投対",
    9 to "受事美予服度発定談表客重持負相要新部和県保返乗屋売送苦泳仮験物具実試使勝界",
    10 to "進酒始業算運漢鳴集配飲終顔落農速頭聞院調鉄語葉習軽線最開頁親公読求転路病横歌起",
    11 to "功成岸競争便老命指初味追神良意労級好昔低育令拾注利位仲放秒別特共努伝戦波洋働",
    12 to "悪息章登寒深倍勉消祭野階庭港暑湯僕島童員商都動第期植根短球泉流合陽歯族旅待温着",
    13 to "皆謝整橋選想器暗疑料感情様養緑熱億殺宿福鏡然詩練賞問館映願士課標銀駅像題輪",
    14 to "能芸雰骨束周協例折基性妥卒固望材参完松約残季技格苺頑囲的術念希狼",
    15 to "紀軍秋信岩仏建猫変晴築勇泣司区英丈夫飯計法晩昼払毒昨帰式列浅単坂匹春寺",
    16 to "浴箱係治危冒留弁証存面遠園門府幸阪急笑荷政品守辞真関険典専冗取曜書",
    17 to "是結底因詳識劇干敗渉果官署察堂幻非愛薬覚常鼻無原栄喜恋悲塩席側兵説細梅虚警",
    18 to "告達焼借弓脳飴胸喫等枚忘苛訓種報句許可祈僧禁静座煙汽叩喉類洗禅",
    19 to "得加冊履忙閥布比歴続減易絡笛容団史昆徒宙混善順宇詞改乱節連舌暴財若",
    20 to "裕尻確械犯害議難災嫌困夢震在飛産罪穴被個機妨倒経率圧防臭余尾論厚妻",
    21 to "責条済委省制批断任素敵羨設評検岡増査審判件際企挙認資義権派務税解総",
    22 to "援態誕状賀各費姿勢諦示寝営坊罰策案提置域応宮袖吸過領脱統価値副観藤",
    23 to "演呼崎施城護鬼割職秀俳停宅痒裁律導革贅乳収現備則規準張優沢師幹看",
    24 to "庁額腕境燃担祝届違差象展層視環製述武型狭管載質量販供肩株触輸腰",
    25 to "慣居逮票属捉捕候輩況響効莫抜鮮満与掛隠模含訟限肥豊替景巻捜構影絞訴補渡",
    26 to "接再独獣菓討故較造創励激占障我徴授往鉛郵針従豚復河貯印振刺突怪汗筆",
    27 to "怒昇迷招腹睡康端極郎健誘貸惑痛退途給就靴眠暇段胃症濃締迫訪織悩屈",
    28 to "攻撃浜綺益児憲冷処微修博程絶凍巨稚幼並麗奇衆清潔録逆移精隊庫妙券傘婦",
    29 to "略積添寄宴板壊督僚杯娘診乾欧恐猛江韓雄航監宗請怖索臣催街詰緊閣促烈",
    30 to "更魅背騒飾預版柵旗浮越照漏系覧婚懐撮枕遊快貧延押乏匂盗購適翌渇符濡",
    31 to "帯廊離径融均豪除貨孫墓幾尋編陸探鑑泥巣普棒粉既救似富散華嘆偵驚掃菜脈徳倉",
    32 to "酸賛祖銭込衛机汚飼複染卵永績眼液採志興恩久党序雑桜密秘厳捨訳欲暖迎傷",
    33 to "灰装著裏閉股垂漠異皇拡屁暮忠肺誌操筋否盛宣賃敬尊熟噂砂簡蒸蔵糖納諸窓",
    34 to "豆枝揮刻爪承咳幕紅歓降奴聖推臓損磁誤源芋純薦丼腐沿射縮隷粋痩吐貴縦勤拝",
    35 to "熊噌彫杉喋銅舎酔炎彼紹介湖講寿測互油己鍋獄戚為恥遅汁醤滞剣破亀厄酢",
    36 to "諾盟将舞債伎鹿換姓牙旧般津療継遺維奈核廃献沖摘及依縄鮭踏伸甘貿頼超幅",
    37 to "患狙陣塁弾葬抗崩遣掲爆眉恵漁香湾跳抱旬聴臨兆契刑募償抵戻昭串闘執跡削",
    38 to "伴齢宜噛賄賂房慮託却需璧致避描刊逃扱奥併膝傾緩奏妊娠贈択還繰抑懸称緒盤",
    39 to "控宛充渋岐埋鈴埼棋囚譲雇免群枠銃仙邦御慎躍謙阜片項斐隆圏勧拒稲奪鋼甲壁祉",
    40 to "拉敏吹唱衝戒兼薄堀剤雅孝頻駆俊嬉誉茂殿殖隣麺繁巡柱携褒排駐顧犠獲鋭敷妖透",
    41 to "棄凄至拠蜂儀炭衣潜偽畑蛍拳郷蜜仁遜侵嘘鉱喧伺徹瀬嘩墟酎措誠虎艦撤樹包",
    42 to "析弧到軸綱挑焦掘紛範括床握枢揚潟芝肝餅喪網克泊双柄哲斎袋揺滑堅暫糾荒",
    43 to "襲沼朗摩趣懲慰懇筒滅距籍露炉柔擦琴垣即威滋牧泰旨刷珍封斉沈撲裂潮貢誰",
    44 to "刃缶砲笠竜拶縁忍釣吉粒髪丘俺斗寸桃梨姫挨娯謎侍叱棚叫辛芽嵐涙雷塔朱翼",
    45 to "頃菌鐘舟嫁暦曇也塾呪湿稼疲翔賭霊溝狩脚澄塊狂嬢裸岳磨陰肌魂矛眺硬卓凶滝井",
    46 to "墨瞬泡穏孔椅菊涼綿魔寮鳩鈍鍛碁癖穂吾鍵盆庄猿棟誇瞳寧俵幽架黙斬帝租錬阻歳零",
    47 to "幣箸瞭崖炊粧墜欺滴塀霧扇扉恨帽憎佐挿伊詐如唇掌婆哀虹爽憩煎尺砕粘畳胴巾芯柳",
    48 to "遂蓄脇殴咲鉢賢彩隙培踊闇斜霜穫麻騎辱灯畜溶蚊帳塗貼輝憶悔耐盾蛇班餓飢迅脅尽",
    49 to "概拘煮覆駒悟慌謀鶴拓衰奨淡礎陛浸劣勘隔蹴桑尼珠抽壇陶妃刈紫唯剛征誓俗潤",
    50 to "偶巧鰐把駄洞伯唐彰諮廷蟹晶堰漂淀堤后疫翻鬱涯銘仰漫簿亭訂壮軌奮峰墳搬邪",
    51 to "又肯浦挟沸瓶召貞亮襟隅郡燥釈脂偉軒蓮慈塚玄肪耕媛邸喚苗隻膚軟郊頂濯渦聡枯",
    52 to "祥呂偏茨陥鎖賠恒綾没擁遭噴殊倫陳隼乃輔猟唆怠惰覇須牲秩孤芳貫糧颯慢膨遇",
    53 to "諭随胡搭錦鯉胞浄帥諒蒙曙惨稿啓披繊徐葵騰据莉緯瓜虐戴艇丹緋准舗壌駿剰寛",
    54 to "庶且顕杏栞欄冠酷叙逸紋阿愚尚拐悠勲疎謡栽践呈傲疾茜酬呆鎌粛茎痴哺荘鯨卸",
    55 to "累伏虜循粗凝栓瑛旦奉遼郭抹佳惜憂悼癒栃龍弥髄勿傍愉赴昌憾朴脊該之鎮尿賓那",
    56 to "匠拍縛飽柴蝶弦凛庸錯轄悦窮嘉弊遥洪紳呉穀摂寂宰陵凡尉靖恭縫舶搾猶窒碑智",
    57 to "盲醸凹弔凸烏敢堕鼓衡伐酵閲遮腸乙楓膜紺蒼漬哉峡賊旋俸喝羅萌槽坪遍胎",
    58 to "陪扶迭鶏瑞暁剖凌藩譜璃淑傑殻瑠錠媒濁赦戯享嘱肖憤朽奔帆菅酌慨絹椎窃硫",
    59 to "亜屯岬鋳拙詠慶酪篤侮堪禍雌睦胆擬梓漆閑憧卑姻忌曹峠吟礁沙蔑汰紡遷叔甚浪崇",
    60 to "煩款蛮廉劾某矯痢逝狐漸升婿匿謹藍桟殉坑罷妄漣藻泌唄畔倹拷醜冥渓湧寡慕",
)
    .associate { (level, characters) ->
        CharactersClassification.Wanikani(level) to characters.map { it.toString() }
    }
